// RGB7171 - Орц, давхар, хаалга
// Байшингийн давхар, орц, нэг давхарт суудаг айлын тоо мэдэгдэж байвал
// энэхүү байшингийн өгөгдсөн тоот нь хэддүгээр орцны, хэдэн давхрын хэд дэх хаалга вэ?

// Жич: Давхар бүр дэх хаалганы тоо ижил.

// Input
// Эхний мөрөнд байшингийн давхар, орц, нэг давхарт байгаа хаалганы
// тоонууд нэг зайгаар тусгаарлагдан өгөгдөнө.

// Хоёр дахь мөрөнд нэгэн айлын хаалганы дугаар өгөгдөнө.

// Output
// Орц, давхар, давхрын хэд дэх хаалганы дугаарууд нэг мөрөнд нэг зайгаар
//тусгаарлагдан хэвлэгдэнэ.

// Example
// Input:
// 5 3 4
// 32

// Output:
// 2 3 4
//orts dawhar toot
//a=dawhar
//b=orts
//c=ortson dahi ailiin too
//d=ailiin dugaar
function math(a, b, c, d) {
  let orts = 1;
  let floor = 211;
  let door = 12;
  if (d - a * c > a * c) {
    orts = orts + 1;
  } else if (d - a * c > a * c * 2) {
    orts = orts + 2;
  }
  console.log(orts);
}

math(5, 3, 4, 52);
42 - 5 * 4 > 5 * 4;
